sfproductlabs/ADuCM350/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM350/bsp/sys/adi_ADuCM350_device.h
/* ================================================================================

     Project      :   ADuCM350
     File         :   ADuCM350_device.h
     Description  :   C Register Definitions

     Date         :   Feb 7, 2017

     Copyright (c) 2014-2017 Analog Devices, Inc.  All Rights Reserved.
     This software is proprietary and confidential to Analog Devices, Inc. and
     its licensors.

     This file was auto-generated. Do not make local changes to this file.

   ================================================================================ */

#ifndef _ADUCM350_DEVICE_H
#define _ADUCM350_DEVICE_H

/* pickup integer types */
#if defined(_LANGUAGE_C) || (defined(__GNUC__) && !defined(__ASSEMBLER__))
#include <stdint.h>
#endif /* _LANGUAGE_C */

/* pickup register bitfield and bit masks */
#include "adi_ADuCM350_typedefs.h"

#ifndef __IO
#ifdef __cplusplus
#define     __I     volatile      /* read-only */
#define     __C
#else
#define     __I     volatile      /* read-only */
#define     __C     const
#endif
#define     __O     volatile      /* write-only */
#define     __IO    volatile      /* read-write */
#endif

#if defined (_MISRA_RULES)
/*
  anonymous unions violate ISO 9899:1990 and therefore MISRA Rule 1.1.
  Use of unions violates MISRA Rule 18.4.
  Anonymous unions are required for this implementation.
  Re-use of identifiers violates MISRA Rule 5.7.
  Field names are repeated for the ADuCM350 register map.
*/
#pragma diag(push)
#pragma diag(suppress:misra_rule_1_1:"Allow anonymous unions")
#pragma diag(suppress:misra_rule_5_1:"Allow names over 32 character limit")
#pragma diag(suppress:misra_rule_5_3:"Header will re-use typedef identifiers")
#pragma diag(suppress:misra_rule_5_6:"Header will re-use identifiers in the same scope")
#pragma diag(suppress:misra_rule_5_7:"Header will re-use identifiers")
#pragma diag(suppress:misra_rule_18_4:"Allow the use of a union")
#endif /* _MISRA_RULES */

/** @defgroup TMR General Purpose Timer (TMR) Module
 *  General Purpose Timer
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_TMR_TypeDef
 *  \brief  General Purpose Timer
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_TMR_TypeDef__
typedef struct _ADI_TMR_TypeDef
{
    __IO     uint16_t   LOAD;                          /*!< 16-bit Load Value */
    __I __C  uint8_t  RESERVED0[2];
    __I __C  uint16_t   CURCNT;                        /*!< 16-bit Timer Value */
    __I __C  uint8_t  RESERVED1[2];
    __IO     uint16_t   CTL;                           /*!< Control */
    __I __C  uint8_t  RESERVED2[2];
    __O      uint16_t   CLRINT;                        /*!< Clear Interrupt */
    __I __C  uint8_t  RESERVED3[2];
    __I __C  uint16_t   CAPTURE;                       /*!< Capture */
    __I __C  uint8_t  RESERVED4[2];
    __IO     uint16_t   ALOAD;                         /*!< 16-bit Load Value, Asynchronous */
    __I __C  uint8_t  RESERVED5[2];
    __I __C  uint16_t   ACURCNT;                       /*!< 16-bit Timer Value, Asynchronous */
    __I __C  uint8_t  RESERVED6[2];
    __I __C  uint16_t   STAT;                          /*!< Status */
    __I __C  uint8_t  RESERVED7[2];
    __IO     uint16_t   PWMCTL;                        /*!< PWM Control Register */
    __I __C  uint8_t  RESERVED8[2];
    __IO     uint16_t   PWMMATCH;                      /*!< PWM Match Value */
    __I __C  uint8_t  RESERVED9[2];
    __IO     uint16_t   EVENTSELECT;                   /*!< Timer Event Selection Register */
} ADI_TMR_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_TMR_TypeDef__ */

/*!@}*/

/** @defgroup TMR_RGB Timer_RGB with 3 PWM outputs (TMR_RGB) Module
 *  Timer_RGB with 3 PWM outputs
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_TMR_RGB_TypeDef
 *  \brief  Timer_RGB with 3 PWM outputs
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_TMR_RGB_TypeDef__
typedef struct _ADI_TMR_RGB_TypeDef
{
    __IO     uint16_t   LOAD;                          /*!< 16-bit load value */
    __I __C  uint8_t  RESERVED0[2];
    __I __C  uint16_t   CURCNT;                        /*!< 16-bit timer value */
    __I __C  uint8_t  RESERVED1[2];
    __IO     uint16_t   CTL;                           /*!< Control */
    __I __C  uint8_t  RESERVED2[2];
    __O      uint16_t   CLRINT;                        /*!< Clear interrupt */
    __I __C  uint8_t  RESERVED3[2];
    __I __C  uint16_t   CAPTURE;                       /*!< Capture */
    __I __C  uint8_t  RESERVED4[2];
    __IO     uint16_t   ALOAD;                         /*!< 16-bit load value, asynchronous */
    __I __C  uint8_t  RESERVED5[2];
    __I __C  uint16_t   ACURCNT;                       /*!< 16-bit timer value, asynchronous */
    __I __C  uint8_t  RESERVED6[2];
    __I __C  uint16_t   STAT;                          /*!< Status */
    __I __C  uint8_t  RESERVED7[2];
    __IO     uint16_t   PWM0CTL;                       /*!< PWM0 Control Register */
    __I __C  uint8_t  RESERVED8[2];
    __IO     uint16_t   PWM0MATCH;                     /*!< PWM0 Match Value */
    __I __C  uint8_t  RESERVED9[2];
    __IO     uint16_t   EVENTSELECT;                   /*!< Timer Event selection Register */
    __I __C  uint8_t  RESERVED10[2];
    __IO     uint16_t   PWM1CTL;                       /*!< PWM1 Control Register */
    __I __C  uint8_t  RESERVED11[2];
    __IO     uint16_t   PWM1MATCH;                     /*!< PWM1 Match Value */
    __I __C  uint8_t  RESERVED12[2];
    __IO     uint16_t   PWM2CTL;                       /*!< PWM2 Control Register */
    __I __C  uint8_t  RESERVED13[2];
    __IO     uint16_t   PWM2MATCH;                     /*!< PWM2 Match Value */
} ADI_TMR_RGB_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_TMR_RGB_TypeDef__ */

/*!@}*/

/** @defgroup RTC Real-Time Clock (RTC) Module
 *  Real-Time Clock
 *  @{
 */

