sfproductlabs/ADuCM350/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM350/bsp/sys/adi_ADuCM350_device.h
/*! ==========================================================================
 *  \struct ADI_RTC_TypeDef
 *  \brief  Real-Time Clock
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_TypeDef__
typedef struct _ADI_RTC_TypeDef
{
    __IO     uint16_t   CR0;                           /*!< RTC Control 0 */
    __I __C  uint8_t  RESERVED0[2];
    __IO     uint16_t   SR0;                           /*!< RTC Status 0 */
    __I __C  uint8_t  RESERVED1[2];
    __I __C  uint16_t   SR1;                           /*!< RTC Status 1 */
    __I __C  uint8_t  RESERVED2[2];
    __IO     uint16_t   CNT0;                          /*!< RTC Count 0 */
    __I __C  uint8_t  RESERVED3[2];
    __IO     uint16_t   CNT1;                          /*!< RTC Count 1 */
    __I __C  uint8_t  RESERVED4[2];
    __IO     uint16_t   ALM0;                          /*!< RTC Alarm 0 */
    __I __C  uint8_t  RESERVED5[2];
    __IO     uint16_t   ALM1;                          /*!< RTC Alarm 1 */
    __I __C  uint8_t  RESERVED6[2];
    __IO     uint16_t   TRM;                           /*!< RTC Trim */
    __I __C  uint8_t  RESERVED7[2];
    __O      uint16_t   GWY;                           /*!< RTC Gateway */
    __I __C  uint8_t  RESERVED8[6];
    __IO     uint16_t   CR1;                           /*!< RTC Control 1 */
    __I __C  uint8_t  RESERVED9[2];
    __IO     uint16_t   SR2;                           /*!< RTC Status 2 */
    __I __C  uint8_t  RESERVED10[2];
    __I __C  uint16_t   SNAP0;                         /*!< RTC Snapshot 0 */
    __I __C  uint8_t  RESERVED11[2];
    __I __C  uint16_t   SNAP1;                         /*!< RTC Snapshot 1 */
    __I __C  uint8_t  RESERVED12[2];
    __I __C  uint16_t   SNAP2;                         /*!< RTC Snapshot 2 */
    __I __C  uint8_t  RESERVED13[2];
    __I __C  uint16_t   MOD;                           /*!< RTC Modulo */
    __I __C  uint8_t  RESERVED14[2];
    __I __C  uint16_t   CNT2;                          /*!< RTC Count 2 */
    __I __C  uint8_t  RESERVED15[2];
    __IO     uint16_t   ALM2;                          /*!< RTC Alarm 2 */
    __I __C  uint8_t  RESERVED16[2];
    __IO     uint16_t   SR3;                           /*!< RTC Status 3 */
    __I __C  uint8_t  RESERVED17[2];
    __IO     uint16_t   CR2IC;                         /*!< RTC Control 2 for Configuring Input Capture Channels */
    __I __C  uint8_t  RESERVED18[2];
    __IO     uint16_t   CR3SS;                         /*!< RTC Control 3 for Configuring SensorStrobe Channel */
    __I __C  uint8_t  RESERVED19[2];
    __IO     uint16_t   CR4SS;                         /*!< RTC Control 4 for Configuring SensorStrobe Channel */
    __I __C  uint8_t  RESERVED20[2];
    __IO     uint16_t   SSMSK;                         /*!< RTC Mask for SensorStrobe Channel */
    __I __C  uint8_t  RESERVED21[10];
    __I __C  uint16_t   IC2;                           /*!< RTC Input Capture Channel 2 */
    __I __C  uint8_t  RESERVED22[2];
    __I __C  uint16_t   IC3;                           /*!< RTC Input Capture Channel 3 */
    __I __C  uint8_t  RESERVED23[2];
    __I __C  uint16_t   IC4;                           /*!< RTC Input Capture Channel 4 */
    __I __C  uint8_t  RESERVED24[2];
    __IO     uint16_t   SS1;                           /*!< RTC SensorStrobe Channel 1 */
    __I __C  uint8_t  RESERVED25[2];
    __IO     uint16_t   SS2;                           /*!< RTC SensorStrobe Channel 2 */
    __I __C  uint8_t  RESERVED26[2];
    __IO     uint16_t   SS3;                           /*!< RTC SensorStrobe Channel 3 */
    __I __C  uint8_t  RESERVED27[2];
    __IO     uint16_t   SS4;                           /*!< RTC SensorStrobe Channel 4 */
    __I __C  uint8_t  RESERVED28[2];
    __I __C  uint16_t   SR4;                           /*!< RTC Status 4 */
    __I __C  uint8_t  RESERVED29[2];
    __I __C  uint16_t   SR5;                           /*!< RTC Status 5 */
    __I __C  uint8_t  RESERVED30[2];
    __I __C  uint16_t   SR6;                           /*!< RTC Status 6 */
    __I __C  uint8_t  RESERVED31[2];
    __I __C  uint16_t   SS1TGT;                        /*!< RTC SensorStrobe Channel 1 Target */
    __I __C  uint8_t  RESERVED32[2];
    __I __C  uint16_t   FRZCNT;                        /*!< RTC Freeze Count */
    __I __C  uint8_t  RESERVED33[2];
    __I __C  uint16_t   SS2TGT;                        /*!< RTC SensorStrobe Channel 2 Target */
    __I __C  uint8_t  RESERVED34[2];
    __I __C  uint16_t   SS3TGT;                        /*!< RTC SensorStrobe Channel 3 Target */
    __I __C  uint8_t  RESERVED35[6];
    __IO     uint16_t   SS1LOWDUR;                     /*!< RTC Auto-Reload Low Duration for SensorStrobe Channel 1 */
    __I __C  uint8_t  RESERVED36[2];
    __IO     uint16_t   SS2LOWDUR;                     /*!< RTC Auto-Reload Low Duration for SensorStrobe Channel 2 */
    __I __C  uint8_t  RESERVED37[2];
    __IO     uint16_t   SS3LOWDUR;                     /*!< RTC Auto-Reload Low Duration for SensorStrobe Channel 3 */
    __I __C  uint8_t  RESERVED38[6];
    __IO     uint16_t   SS1HIGHDUR;                    /*!< RTC Auto-Reload High Duration for SensorStrobe Channel 1 */
    __I __C  uint8_t  RESERVED39[2];
    __IO     uint16_t   SS2HIGHDUR;                    /*!< RTC Auto-Reload High Duration for SensorStrobe Channel 2 */
    __I __C  uint8_t  RESERVED40[2];
    __IO     uint16_t   SS3HIGHDUR;                    /*!< RTC Auto-Reload High Duration for SensorStrobe Channel 3 */
    __I __C  uint8_t  RESERVED41[6];
    __IO     uint16_t   SSMSKOT;                       /*!< RTC Masks for SensorStrobe Channels on Time Control */
    __I __C  uint8_t  RESERVED42[2];
    __IO     uint16_t   CR5SSS;                        /*!< RTC Control 5 for Configuring SensorStrobe Channel GPIO Sampling */
    __I __C  uint8_t  RESERVED43[2];
    __IO     uint16_t   CR6SSS;                        /*!< RTC Control 6 for Configuring SensorStrobe Channel GPIO Sampling Edge */
    __I __C  uint8_t  RESERVED44[2];
    __IO     uint16_t   CR7SSS;                        /*!< RTC Control 7 for Configuring SensorStrobe Channel GPIO Sampling Activity */
    __I __C  uint8_t  RESERVED45[2];
    __IO     uint16_t   SR7;                           /*!< RTC Status 7 */
    __I __C  uint8_t  RESERVED46[2];
    __I __C  uint16_t   SR8;                           /*!< RTC Status 8 */
    __I __C  uint8_t  RESERVED47[2];
    __I __C  uint16_t   SR9;                           /*!< RTC Status 9 */
    __I __C  uint8_t  RESERVED48[6];
    __IO     uint16_t   GPMUX0;                        /*!< RTC GPIO Pin Mux Control Register 0 */
    __I __C  uint8_t  RESERVED49[2];
    __IO     uint16_t   GPMUX1;                        /*!< RTC GPIO Pin Mux Control Register 1 */
} ADI_RTC_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_TypeDef__ */

