sfproductlabs/ADuCM350/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM350/bsp/sys/adi_ADuCM350_device.h
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ADC_TypeDef__ */

/*!@}*/

/** @defgroup DMA DMA (DMA) Module
 *  DMA
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_DMA_TypeDef
 *  \brief  DMA
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_DMA_TypeDef__
typedef struct _ADI_DMA_TypeDef
{
    __I __C  uint32_t   STAT;                          /*!< DMA Status */
    __O      uint32_t   CFG;                           /*!< DMA Configuration */
    __IO     uint32_t   PDBPTR;                        /*!< DMA Channel Primary Control Database Pointer */
    __I __C  uint32_t   ADBPTR;                        /*!< DMA Channel Alternate Control Database Pointer */
    __I __C  uint8_t  RESERVED0[4];
    __O      uint32_t   SWREQ;                         /*!< DMA Channel Software Request */
    __I __C  uint8_t  RESERVED1[8];
    __IO     uint32_t   RMSK_SET;                      /*!< DMA Channel Request Mask Set */
    __O      uint32_t   RMSK_CLR;                      /*!< DMA Channel Request Mask Clear */
    __IO     uint32_t   EN_SET;                        /*!< DMA Channel Enable Set */
    __O      uint32_t   EN_CLR;                        /*!< DMA Channel Enable Clear */
    __IO     uint32_t   ALT_SET;                       /*!< DMA Channel Primary Alternate Set */
    __O      uint32_t   ALT_CLR;                       /*!< DMA Channel Primary Alternate Clear */
    __O      uint32_t   PRI_SET;                       /*!< DMA Channel Priority Set */
    __O      uint32_t   PRI_CLR;                       /*!< DMA Channel Priority Clear */
    __I __C  uint8_t  RESERVED2[8];
    __IO     uint32_t   ERRCHNL_CLR;                   /*!< DMA per Channel Error Clear */
    __IO     uint32_t   ERR_CLR;                       /*!< DMA Bus Error Clear */
    __IO     uint32_t   INVALIDDESC_CLR;               /*!< DMA per Channel Invalid Descriptor Clear */
    __I __C  uint8_t  RESERVED3[1964];
    __IO     uint32_t   BS_SET;                        /*!< DMA Channel Bytes Swap Enable Set */
    __O      uint32_t   BS_CLR;                        /*!< DMA Channel Bytes Swap Enable Clear */
    __I __C  uint8_t  RESERVED4[8];
    __IO     uint32_t   SRCADDR_SET;                   /*!< DMA Channel Source Address Decrement Enable Set */
    __O      uint32_t   SRCADDR_CLR;                   /*!< DMA Channel Source Address Decrement Enable Clear */
    __IO     uint32_t   DSTADDR_SET;                   /*!< DMA Channel Destination Address Decrement Enable Set */
    __O      uint32_t   DSTADDR_CLR;                   /*!< DMA Channel Destination Address Decrement Enable Clear */
    __I __C  uint8_t  RESERVED5[1984];
    __I __C  uint32_t   REVID;                         /*!< DMA Controller Revision ID */
} ADI_DMA_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_DMA_TypeDef__ */

/*!@}*/

/** @defgroup FLCC Flash Controller (FLCC) Module
 *  Flash Controller
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_FLCC_TypeDef
 *  \brief  Flash Controller
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_FLCC_TypeDef__
typedef struct _ADI_FLCC_TypeDef
{
    __IO     uint32_t   STAT;                          /*!< Status */
    __IO     uint32_t   IEN;                           /*!< Interrupt Enable */
    __IO     uint32_t   CMD;                           /*!< Command */
    __IO     uint32_t   KH_ADDR;                       /*!< Write Address */
    __IO     uint32_t   KH_DATA0;                      /*!< Write Lower Data */
    __IO     uint32_t   KH_DATA1;                      /*!< Write Upper Data */
    __IO     uint32_t   PAGE_ADDR0;                    /*!< Lower Page Address */
    __IO     uint32_t   PAGE_ADDR1;                    /*!< Upper Page Address */
    __O      uint32_t   KEY;                           /*!< Key */
    __I __C  uint32_t   WR_ABORT_ADDR;                 /*!< Write Abort Address */
    __IO     uint32_t   WRPROT;                        /*!< Write Protection */
    __I __C  uint32_t   SIGNATURE;                     /*!< Signature */
    __IO     uint32_t   UCFG;                          /*!< User Configuration */
    __IO     uint32_t   TIME_PARAM0;                   /*!< Time Parameter 0 */
    __IO     uint32_t   TIME_PARAM1;                   /*!< Time Parameter 1 */
    __IO     uint32_t   ABORT_EN_LO;                   /*!< IRQ Abort Enable (Lower Bits) */
    __IO     uint32_t   ABORT_EN_HI;                   /*!< IRQ Abort Enable (Upper Bits) */
    __IO     uint32_t   ECC_CFG;                       /*!< ECC Configuration */
    __I __C  uint32_t   ECC_ADDR;                      /*!< ECC Status (Address) */
    __I __C  uint8_t  RESERVED0[4];
    __IO     uint32_t   POR_SEC;                       /*!< Flash Security */
    __IO     uint32_t   VOL_CFG;                       /*!< Volatile Flash Configuration */
} ADI_FLCC_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_FLCC_TypeDef__ */

/*!@}*/

/** @defgroup FLCC_CACHE Cache Controller (FLCC_CACHE) Module
 *  Cache Controller
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_FLCC_CACHE_TypeDef
 *  \brief  Cache Controller
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_FLCC_CACHE_TypeDef__
typedef struct _ADI_FLCC_CACHE_TypeDef
{
    __I __C  uint32_t   STAT;                          /*!< Cache Status Register */
    __IO     uint32_t   SETUP;                         /*!< Cache Setup Register */
    __O      uint32_t   KEY;                           /*!< Cache Key Register */
    __I __C  uint8_t  RESERVED0[40];
} ADI_FLCC_CACHE_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_FLCC_CACHE_TypeDef__ */

/*!@}*/

/** @defgroup GPIO  (GPIO) Module
 *  
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_GPIO_TypeDef
 *  \brief  
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_GPIO_TypeDef__
typedef struct _ADI_GPIO_TypeDef
{
    __IO     uint32_t   CFG;                           /*!< Port  Configuration */
    __IO     uint16_t   OEN;                           /*!< Port Output Enable */
    __I __C  uint8_t  RESERVED0[2];
    __IO     uint16_t   PE;                            /*!< Port Output Pull-up/Pull-down Enable */
    __I __C  uint8_t  RESERVED1[2];
    __IO     uint16_t   IEN;                           /*!< Port  Input Path Enable */
    __I __C  uint8_t  RESERVED2[2];
    __I __C  uint16_t   IN;                            /*!< Port  Registered Data Input */
    __I __C  uint8_t  RESERVED3[2];
    __IO     uint16_t   OUT;                           /*!< Port Data Output */
    __I __C  uint8_t  RESERVED4[2];
    __O      uint16_t   SET;                           /*!< Port Data Out Set */
    __I __C  uint8_t  RESERVED5[2];
    __O      uint16_t   CLR;                           /*!< Port Data Out Clear */
    __I __C  uint8_t  RESERVED6[2];
    __O      uint16_t   TGL;                           /*!< Port Pin Toggle */
    __I __C  uint8_t  RESERVED7[2];
    __IO     uint16_t   POL;                           /*!< Port Interrupt Polarity */
    __I __C  uint8_t  RESERVED8[2];
    __IO     uint16_t   IENA;                          /*!< Port Interrupt A Enable */
    __I __C  uint8_t  RESERVED9[2];
    __IO     uint16_t   IENB;                          /*!< Port Interrupt B Enable */
    __I __C  uint8_t  RESERVED10[2];
    __IO     uint16_t   INT;                           /*!< Port Interrupt Status */
    __I __C  uint8_t  RESERVED11[2];
    __IO     uint16_t   DS;                            /*!< Port Drive Strength Select */
} ADI_GPIO_TypeDef;
