sfproductlabs/ADuCM350/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM350/bsp/sys/adi_ADuCM350_device.h
#endif /* !__ADI_NO_DECL_STRUCT_ADI_GPIO_TypeDef__ */

/*!@}*/

/** @defgroup SPORT Serial Port (SPORT) Module
 *  Serial Port
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_SPORT_TypeDef
 *  \brief  Serial Port
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPORT_TypeDef__
typedef struct _ADI_SPORT_TypeDef
{
    __IO     uint32_t   CTL_A;                         /*!< Half SPORT 'A' Control Register */
    __IO     uint32_t   DIV_A;                         /*!< Half SPORT 'A' Divisor Register */
    __IO     uint32_t   IEN_A;                         /*!< Half SPORT A's Interrupt Enable register */
    __IO     uint32_t   STAT_A;                        /*!< Half SPORT 'A' Status register */
    __IO     uint32_t   NUMTRAN_A;                     /*!< Half SPORT A Number of transfers register */
    __IO     uint32_t   CNVT_A;                        /*!< Half SPORT 'A' CNV width */
    __I __C  uint8_t  RESERVED0[8];
    __O      uint32_t   TX_A;                          /*!< Half SPORT 'A' Tx Buffer Register */
    __I __C  uint8_t  RESERVED1[4];
    __I __C  uint32_t   RX_A;                          /*!< Half SPORT 'A' Rx Buffer Register */
    __I __C  uint8_t  RESERVED2[20];
    __IO     uint32_t   CTL_B;                         /*!< Half SPORT 'B' Control Register */
    __IO     uint32_t   DIV_B;                         /*!< Half SPORT 'B' Divisor Register */
    __IO     uint32_t   IEN_B;                         /*!< Half SPORT B's Interrupt Enable register */
    __IO     uint32_t   STAT_B;                        /*!< Half SPORT 'B' Status register */
    __IO     uint32_t   NUMTRAN_B;                     /*!< Half SPORT B Number of transfers register */
    __IO     uint32_t   CNVT_B;                        /*!< Half SPORT 'B' CNV width register */
    __I __C  uint8_t  RESERVED3[8];
    __O      uint32_t   TX_B;                          /*!< Half SPORT 'B' Tx Buffer Register */
    __I __C  uint8_t  RESERVED4[4];
    __I __C  uint32_t   RX_B;                          /*!< Half SPORT 'B' Rx Buffer Register */
    __I __C  uint8_t  RESERVED5[16];
} ADI_SPORT_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPORT_TypeDef__ */

/*!@}*/

/** @defgroup CRC CRC Accelerator (CRC) Module
 *  CRC Accelerator
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_CRC_TypeDef
 *  \brief  CRC Accelerator
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRC_TypeDef__
typedef struct _ADI_CRC_TypeDef
{
    __IO     uint32_t   CTL;                           /*!< CRC Control */
    __O      uint32_t   IPDATA;                        /*!< Input Data Word */
    __IO     uint32_t   RESULT;                        /*!< CRC Result */
    __IO     uint32_t   POLY;                          /*!< Programmable CRC Polynomial */
    union {
    __O      uint8_t    IPBITS[8];                     /*!< Input Data Bits */
    __O      uint8_t    IPBYTE;                        /*!< Input Data Byte */
    };
} ADI_CRC_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRC_TypeDef__ */

/*!@}*/

/** @defgroup RNG Random Number Generator (RNG) Module
 *  Random Number Generator
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_RNG_TypeDef
 *  \brief  Random Number Generator
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RNG_TypeDef__
typedef struct _ADI_RNG_TypeDef
{
    __IO     uint16_t   CTL;                           /*!< RNG Control Register */
    __I __C  uint8_t  RESERVED0[2];
    __IO     uint16_t   LEN;                           /*!< RNG Sample Length Register */
    __I __C  uint8_t  RESERVED1[2];
    __IO     uint16_t   STAT;                          /*!< RNG Status Register */
    __I __C  uint8_t  RESERVED2[2];
    __I __C  uint32_t   DATA;                          /*!< RNG Data Register */
    __I __C  uint32_t   OSCCNT;                        /*!< Oscillator Count */
    __I __C  int8_t     OSCDIFF[4];                    /*!< Oscillator Difference */
} ADI_RNG_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RNG_TypeDef__ */

/*!@}*/

/** @defgroup CRYPT Register Map for the Crypto Block (CRYPT) Module
 *  Register Map for the Crypto Block
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_CRYPT_TypeDef
 *  \brief  Register Map for the Crypto Block
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_TypeDef__
typedef struct _ADI_CRYPT_TypeDef
{
    __IO     uint32_t   CFG;                           /*!< Configuration Register */
    __IO     uint32_t   DATALEN;                       /*!< Payload Data Length */
    __IO     uint32_t   PREFIXLEN;                     /*!< Authentication Data Length */
    __IO     uint32_t   INTEN;                         /*!< Interrupt Enable Register */
    __IO     uint32_t   STAT;                          /*!< Status Register */
    __O      uint32_t   INBUF;                         /*!< Input Buffer */
    __I __C  uint32_t   OUTBUF;                        /*!< Output Buffer */
    __IO     uint32_t   NONCE0;                        /*!< Nonce Bits [31:0] */
    __IO     uint32_t   NONCE1;                        /*!< Nonce Bits [63:32] */
    __IO     uint32_t   NONCE2;                        /*!< Nonce Bits [95:64] */
    __IO     uint32_t   NONCE3;                        /*!< Nonce Bits [127:96] */
    __O      uint32_t   AESKEY0;                       /*!< AES Key Bits [31:0] */
    __O      uint32_t   AESKEY1;                       /*!< AES Key Bits [63:32] */
    __O      uint32_t   AESKEY2;                       /*!< AES Key Bits [95:64] */
    __O      uint32_t   AESKEY3;                       /*!< AES Key Bits [127:96] */
    __O      uint32_t   AESKEY4;                       /*!< AES Key Bits [159:128] */
    __O      uint32_t   AESKEY5;                       /*!< AES Key Bits [191:160] */
    __O      uint32_t   AESKEY6;                       /*!< AES Key Bits [223:192] */
    __O      uint32_t   AESKEY7;                       /*!< AES Key Bits [255:224] */
    __IO     uint32_t   CNTRINIT;                      /*!< Counter Initialization Vector */
    __IO     uint32_t   SHAH0;                         /*!< SHA Bits [31:0] */
    __IO     uint32_t   SHAH1;                         /*!< SHA Bits [63:32] */
    __IO     uint32_t   SHAH2;                         /*!< SHA Bits [95:64] */
    __IO     uint32_t   SHAH3;                         /*!< SHA Bits [127:96] */
    __IO     uint32_t   SHAH4;                         /*!< SHA Bits [159:128] */
    __IO     uint32_t   SHAH5;                         /*!< SHA Bits [191:160] */
    __IO     uint32_t   SHAH6;                         /*!< SHA Bits [223:192] */
    __IO     uint32_t   SHAH7;                         /*!< SHA Bits [255:224] */
    __IO     uint32_t   SHA_LAST_WORD;                 /*!< SHA Last Word and Valid Bits Information */
    __IO     uint32_t   CCM_NUM_VALID_BYTES;           /*!< NUM_VALID_BYTES */
    __IO     uint32_t   PRKSTORCFG;                    /*!< PRKSTOR Configuration */
    __I __C  uint8_t  RESERVED0[4];
    __O      uint32_t   KUW0;                          /*!< Key Wrap Unwrap Register 0 */
    __O      uint32_t   KUW1;                          /*!< Key Wrap Unwrap Register 1 */
    __O      uint32_t   KUW2;                          /*!< Key Wrap Unwrap Register 2 */
    __O      uint32_t   KUW3;                          /*!< Key Wrap Unwrap Register 3 */
    __O      uint32_t   KUW4;                          /*!< Key Wrap Unwrap Register 4 */
    __O      uint32_t   KUW5;                          /*!< Key Wrap Unwrap Register 5 */
    __O      uint32_t   KUW6;                          /*!< Key Wrap Unwrap Register 6 */
    __O      uint32_t   KUW7;                          /*!< Key Wrap Unwrap Register 7 */
    __O      uint32_t   KUW8;                          /*!< Key Wrap Unwrap Register 8 */
    __O      uint32_t   KUW9;                          /*!< Key Wrap Unwrap Register 9 */
    __O      uint32_t   KUW10;                         /*!< Key Wrap Unwrap Register 10 */
    __O      uint32_t   KUW11;                         /*!< Key Wrap Unwrap Register 11 */
    __O      uint32_t   KUW12;                         /*!< Key Wrap Unwrap Register 12 */
    __O      uint32_t   KUW13;                         /*!< Key Wrap Unwrap Register 13 */
    __O      uint32_t   KUW14;                         /*!< Key Wrap Unwrap Register 14 */
    __O      uint32_t   KUW15;                         /*!< Key Wrap Unwrap Register 15 */
    __O      uint32_t   KUWVALSTR1;                    /*!< Key Wrap Unwrap Validation String [63:32] */
    __O      uint32_t   KUWVALSTR2;                    /*!< Key Wrap Unwrap Validation String [31:0] */
} ADI_CRYPT_TypeDef;
